---
kind: type
id: T:Autodesk.Revit.DB.CurtainSystemBase
source: html/e812f3f4-8c6d-2741-fac0-53724e723338.htm
---
# Autodesk.Revit.DB.CurtainSystemBase

Provides access to the CurtainSystemBase object in Autodesk Revit.

## Syntax (C#)
```csharp
public class CurtainSystemBase : HostObject
```

## Remarks
This is the base class of CurtainSystem.